{"doc_id": "final1", "text": "--- PAGE 1 ---\nK. K. Wagh Institute of Engineering Education & Research, Nashik\nDepartment of Computer Engineering\nUnit 3\nTitle: Patent Studied\nStudent's Name:Atharva Bagade Div: B Roll No.:05\nCourse Code and Name:COM223018 Intellectual Property Rights\nName of Faculty: Dr. S. M. Kamalapur\nDate of Submission:17/04/2025\nPatent Overview\n Patent Title: System and method for determining solar irradiance using satellite\nimaging\n Patent Number: US10073413B2\n Patent Holder/Assignee: Clean Power Research, L.L.C.\n Filing Date: March 25, 2014\n Grant Date: September 11, 2018\n Patent Type: Utility Patent\n Inventor(s): Thomas E. Hoff, Richard Perez\nPatent Details\n Summary of the Invention: This patent introduces a sophisticated method to\ndetermine solar irradiance by leveraging satellite data enhanced with real-time\natmospheric corrections. The goal is to assess the actual sunlight available on the\nEarth's surface for solar power generation. By using multispectral satellite imagery\nand integrating it with weather data such as cloud cover and air pollution, the system\nprovides dynamic and accurate assessments of solar power potential. This facilitates\nprecise energy modeling, especially important for regions like Delhi where pollution\nand weather variations can significantly influence solar energy efficiency.\n Key Claims:\n1. A method for estimating solar irradiance using satellite-based images and weather\ninformation.\n2. A system to update irradiance estimations in real-time based on changes in atmospheric\nconditions.\n3. A software platform for visualizing irradiance data and supporting solar infrastructure\nplanning.\n--- PAGE 2 ---\n Novelty of the Invention: The innovation lies in its integration of satellite imaging with\nreal-time atmospheric data to produce highly accurate solar irradiance estimates. Unlike\nprevious static models, this system can dynamically adapt to changing environmental\nconditions, providing up-to-date solar potential data across various geographic areas.\n Market Value: This technology has been adopted by utilities and solar energy companies\nfor efficient solar forecasting and grid management. It contributes significantly to reducing\nrisks in solar investments and enhances the strategic planning of solar farms. Its market value\nis highlighted by its adoption in regions with variable climates, enabling cost-effective and\nsustainable energy planning."}